app/controllers/action_templates_controller.rb

SELECT "action_templates".* FROM "action_templates"
---
  def index
    included = params[:include].try(:split, ",")
    render json: ActionTemplate.all, include: included