app/controllers/actions_controller.rb

SELECT "actions".* FROM "actions"
---
  def index
    included = params[:include].try(:split, ",")
    render json: Action.all, include: included