app/controllers/apps_controller.rb

SELECT "apps".* FROM "apps"
---
  def index
    included = params[:include].try(:split, ",")
    render json: App.all, include: included

SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    included = params[:include].try(:split, ",")
    id = params[:id]
    @app = App.find_by(id: id)

INSERT INTO "apps" ("name", "key", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test App3"], ["key", "testapp3"], ["description", "A Test app3"], ["created_at", "2016-02-20 17:29:43.404822"], ["updated_at", "2016-02-20 17:29:43.404822"]]
INSERT INTO "apps_lane_templates" ("lane_template_id", "app_id") VALUES (?, ?)  [["lane_template_id", 1], ["app_id", 7]]
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lane_templates".* FROM "lane_templates" WHERE "lane_templates"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    @app = App.new(app_params)
    @app.lane_templates << LaneTemplate.find(1)