app/controllers/builds_controller.rb

SELECT "builds".* FROM "builds"
---
  def index
    included = params[:include].try(:split, ",")
    render json: Build.all, include: included