app/controllers/lanes_controller.rb

SELECT "actions".* FROM "actions" WHERE "actions"."lane_id" = ?  [["lane_id", 1]]
SELECT "lanes".* FROM "lanes"
---
  def index
    included = params[:include].try(:split, ",")
    render json: Lane.all, include: ["actions"]