app/controllers/lane_templates_controller.rb

  def index
    included = params[:include].try(:split, ",")
    render json: LaneTemplate.all, include: included
---
SELECT "lane_templates".* FROM "lane_templates"